app/controllers/appointments_controller.rb

  def create
    Time.zone = appointment_params[:time_zone]
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("name", "phone_number", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "jagadeesh"], ["phone_number", "8555844128"], ["time", "2017-02-06 07:10:00.000000"], ["created_at", "2017-02-06 04:06:26.116384"], ["updated_at", "2017-02-06 04:06:26.116384"]]